# fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# core apps
cask "1password"
cask "1password-cli"
cask "adguard"
cask "airbuddy"
cask "alcove"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "betterdisplay"
cask "chatgpt"
cask "ghostty"
cask "iina"
cask "keka"
cask "raycast"
cask "rectangle-pro"
cask "shottr"
cask "textsniper"
cask "yoink"
cask "zed"

# utility / power-user apps
cask "bloom"
cask "cleanmymac"
cask "cleanshot"
cask "clop"
cask "disk-drill"
cask "displaybuddy"
cask "downie"
cask "hazel"
cask "imazing"
cask "istat-menus"
cask "keyboard-maestro"
cask "lunar"
cask "mac-mouse-fix"
cask "maccy"
cask "mediamate"
cask "mountain-duck"
cask "notchnook"
cask "numi"
cask "permute"
cask "popclip"
cask "rewritebar"
cask "swish"
cask "taphouse"
cask "updatest"
cask "voiceink"
cask "wispr-flow"
