# Taps
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "thusvill/livewallpaper"
tap "vitorgalvao/tiny-scripts"

# Brew formulae
brew "antidote"
brew "ast-grep"
brew "awscli"
brew "bash"
brew "bat"
brew "black"
brew "blueutil"
brew "btop"
brew "cmake"
brew "colima"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-compose"
brew "duck"
brew "eza"
brew "ffmpeg"
brew "folderify"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "gifsicle"
brew "go"
brew "harfbuzz"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "libavif"
brew "libheif"
brew "libraw"
brew "mise"
brew "mkcert"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk"
brew "oxipng"
brew "p0f"
brew "php"
brew "pkgconf"
brew "pillow"
brew "pngpaste"
brew "pngquant"
brew "pure"
brew "pyenv"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "wordnet"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zinit"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# Felixkratz extras
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# Koekeishiya extras
brew "koekeishiya/formulae/skhd"

# Casks
cask "1password@beta"
cask "1password-cli@beta"
cask "airbuddy"
cask "alcove"
cask "alfred"
cask "antinote"
cask "appcleaner"
cask "badgeify"
cask "bartender"
cask "betterdisplay"
cask "bettertouchtool"
cask "blip"
cask "boltai"
cask "bruno"
cask "charmstone"
cask "chatgpt"
cask "cleanmymac"
cask "cleanshot"
cask "clop"
cask "cryptomator"
cask "cork"
cask "customshortcuts"
cask "daisydisk"
cask "deltawalker"
cask "discord"
cask "disk-drill"
cask "dockdoor"
cask "dockfix"
cask "downie"
cask "drivedx"
cask "folx"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "gitkraken"
cask "gitkraken-cli"
cask "hazel"
cask "homerow"
cask "iina"
cask "imazing"
cask "iterm2"
cask "istat-menus"
cask "jordanbaird-ice"
cask "keyboard-maestro"
cask "keyclu"
cask "keycue"
cask "kitty"
cask "latest"
cask "launchbar"
cask "mac-mouse-fix"
cask "maccy"
cask "macupdater"
cask "menubarx"
cask "middle"
cask "mist"
cask "mos"
cask "mountain-duck"
cask "multitouch"
cask "numi"
cask "path-finder"
cask "pearcleaner"
cask "permute"
cask "popclip"
cask "powershell"
cask "rectangle-pro"
cask "shottr"
cask "surfshark"
cask "swish"
cask "tabtab"
cask "thelowtechguys-cling"
cask "typinator"
cask "tuist"
cask "voiceink"
cask "wezterm"
cask "xcodes-app"

# Mac App Store
mas "1Blocker",                  id: 1365531024
mas "1Password for Safari",      id: 0
mas "Acidity",                   id: 6472630023
mas "Apple Configurator",        id: 1037126344
mas "Auto Scroll and Read",      id: 6657988236
mas "BarMarks",                  id: 6739710035
mas "Boom 3D",                   id: 1233048948
mas "CARROTweather",             id: 993487541
mas "ColorSlurp",                id: 1287239339
mas "CotEditor",                 id: 1024640650
mas "Deliveries",                id: 290986013
mas "DeskMinder",                id: 6740942938
mas "Dropover",                  id: 1355679052
mas "Enable Right Click for Safari", id: 6472667926
mas "Fantastical",               id: 975937182
mas "Filebar",                   id: 1630856656
mas "Fluro",                     id: 6736510658
mas "Folder Peek",               id: 1615988943
mas "Folx GO+",                  id: 823528286
mas "Friendly Streaming",        id: 553245401
mas "Full Page Screenshot for Safari", id: 6745571462
mas "Gestimer",                  id: 6447125648
mas "Glimpse",                   id: 1524217845
mas "Homecoming for Mastodon",   id: 1666139593
mas "Hush",                      id: 1544743900
mas "Image2Icon",                id: 992115977
mas "iMazing Converter",         id: 1292198261
mas "iMazing Profile Editor",    id: 1487860882
mas "Klack",                     id: 6446206067
mas "Keka",                      id: 470158793
mas "Leftovers",                 id: 6746164364
mas "Link Unshortener",          id: 150075146
mas "Liss Auto Scroll",          id: 6744896111
mas "Magnet",                    id: 441258766
mas "Mapper",                    id: 1589391989
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "Mercury",                   id: 1621800675
mas "MoneyCoach",                id: 989642198
mas "MousHero for Safari",       id: 6447680045
mas "MyApplications",            id: 1630766571
mas "MyWallpaper",               id: 1552826194
mas "Noir",                      id: 1592917505
mas "Numbers",                   id: 409203825
mas "Owlfiles",                  id: 510282524
mas "Paprika Recipe Manager 3",  id: 1303222628
mas "Pasteboard Viewer",         id: 1499215709
mas "Peek",                      id: 1554235898
mas "Pixelmator Pro",            id: 1289583905
mas "Randa",                     id: 1589044499
mas "rcmd",                      id: 1596283165
mas "ReddBar",                   id: 6739960301
mas "Redirect Web for Safari",   id: 1571283503
mas "Refined GitHub",            id: 1519867270
mas "Save to Raindrop.io",       id: 1549370672
mas "Scratchpad",                id: 6504040051
mas "ShellHistory",              id: 1564015476
mas "Simple Color Palette",      id: 6744484427
mas "SingleFile",                id: 6444324545
mas "Sink It",                   id: 6449873635
mas "SnippetsLab",               id: 1006087419
mas "Snippety",                  id: 1530751461
mas "StopTheMadness Pro",        id: 6471380298
mas "Subscriptions",             id: 1577082754
mas "Super Agent",               id: 1568262835
mas "TabBack",                   id: 1660506599
mas "Tampermonkey",              id: 6738342400
mas "TestFlight",                id: 899247664
mas "Text Workflow",             id: 1600520682
mas "Textastic",                 id: 572491815
mas "Things",                    id: 904280696
mas "Toolbox",                   id: 6470455406
mas "Total Refresh",             id: 1573919086
mas "ToyViewer",                 id: 414298354
mas "TypeGenius",                id: 6469731855
mas "UltraNotes",                id: 6468902627
mas "uBlock Origin Lite",        id: 0
mas "URLtoQR",                   id: 1586089723
mas "Userscripts",               id: 1463298887
mas "VidHub",                    id: 1659622164
mas "Vidimote",                  id: 1585702412
mas "Vinegar",                   id: 1591303229
mas "Wipr",                      id: 1662217862
mas "xReload",                   id: 1588834516
mas "xSearch",                   id: 1579902068
mas "Yoink",                     id: 457622435
