cask "airbuddy"
cask "alfred"
cask "bartender"
cask "betterdisplay"
cask "cleanmymac"
cask "cleanshot"
cask "clop"
cask "disk-drill"
cask "downie"
cask "hazel"
cask "imazing"
cask "istat-menus"
cask "keyboard-maestro"
cask "lunar"
cask "mac-mouse-fix"
cask "maccy"
cask "mediamate"
cask "mountain-duck"
cask "notchnook"
cask "numi"
cask "permute"
cask "popclip"
cask "rewritebar"
cask "swish"
cask "taphouse"
cask "voiceink"
cask "wispr-flow"
