tap "homebrew/bundle"
tap "oven-sh/bun"
tap "stripe/stripe-cli"
tap "stripe/stripe-mock"

# Formulae
brew "ada-url"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "autoconf"
brew "awscli"
brew "bash"
brew "bat"
brew "brotli"
brew "btop"
brew "bun"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cloudflared"
brew "coreutils"
brew "curl"
brew "dav1d"
brew "deno"
brew "direnv"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fmt"
brew "folderify"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "fribidi"
brew "fzf"
brew "gd"
brew "gettext"
brew "gh"
brew "giflib"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-filter-repo"
brew "glib"
brew "gmp"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "graphite2"
brew "grep"
brew "harfbuzz"
brew "hdrhistogram_c"
brew "highway"
brew "icu4c@78"
brew "imagemagick"
brew "imath"
brew "jp2a"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jpegoptim"
brew "jq"
brew "krb5"
brew "lame"
brew "lazygit"
brew "libassuan"
brew "libavif"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libexif"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libheif"
brew "libidn2"
brew "libimagequant"
brew "libksba"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libpng"
brew "libpq"
brew "libraqm"
brew "libsodium"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtommath"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvmaf"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libzip"
brew "little-cms2"
brew "llhttp"
brew "lz4"
brew "lzo"
brew "m4"
brew "mas"
brew "merve"
brew "mise"
brew "mkcert"
brew "mpdecimal"
brew "nbytes"
brew "ncurses"
brew "net-snmp"
brew "nettle"
brew "node"
brew "npth"
brew "oniguruma"
brew "openexr"
brew "openjpeg"
brew "openjph"
brew "openldap"
brew "openssl@3"
brew "opus"
brew "oxipng"
brew "p11-kit"
brew "pcre2"
brew "php"
brew "pillow"
brew "pinentry"
brew "pinentry-mac"
brew "pipx"
brew "pixman"
brew "pngpaste"
brew "pngquant"
brew "postgresql@17"
brew "python-tk@3.14"
brew "python@3.14"
brew "readline"
brew "redis"
brew "ripgrep"
brew "sdl2"
brew "sheldon"
brew "simdjson"
brew "simdutf"
brew "spaceman-diff"
brew "sqlite"
brew "starship"
brew "stow"
brew "stripe"
brew "stripe-cli"
brew "stripe-mock"
brew "svt-av1"
brew "tcl-tk"
brew "tidy-html5"
brew "tmux"
brew "topgrade"
brew "tree"
brew "unbound"
brew "unixodbc"
brew "usage"
brew "utf8proc"
brew "uvwasi"
brew "watch"
brew "webp"
brew "wget"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xz"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zstd"

# Casks
cask "1password"
cask "1password-cli"
cask "adguard"
cask "airbuddy"
cask "alcove"
cask "alfred"
cask "antinote"
cask "appcleaner"
cask "bartender"
cask "betterdisplay"
cask "bloom"
cask "chatgpt"
cask "cleanmymac"
cask "cleanshot"
cask "clop"
cask "cork"
cask "disk-drill"
cask "downie"
cask "folder-preview-pro"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "hazel"
cask "iina"
cask "image2icon"
cask "imazing"
cask "istat-menus"
cask "keka"
cask "keyboard-maestro"
cask "lunar"
cask "mac-mouse-fix"
cask "maccy"
cask "mediamate"
cask "mountain-duck"
cask "notchnook"
cask "numi"
cask "permute"
cask "popclip"
cask "raycast"
cask "rectangle-pro"
cask "rewritebar"
cask "shottr"
cask "superhuman"
cask "swish"
cask "taphouse"
cask "textsniper"
cask "thaw"
cask "thelowtechguys-cling"
cask "updatest"
cask "voiceink"
cask "wispr-flow"
cask "yoink"
cask "zed"
