# Brewfile -- Justin (FINAL: merged, deduped, categorized)
# Date: 2025-10-31
# Notes:
#   • Merged from 5 Brewfiles (including Brewfile 2.txt, multiple Brewfile.txt).
#   • Deduplicated all entries; kept non-beta versions unless @beta/@tip explicitly preferred.
#   • Prefer MAS for DaisyDisk & Maccy → cask versions removed.
#   • iterm2@beta → iterm2-beta; 1password@beta → 1password (stable).
#   • Kept only Nerd Font variants (font-jetbrains-mono dropped).
#   • Added new tools: ghostty@tip, chatgpt-atlas, fixkey, imazing, pinentry-mac, etc.
#   • All sections alphabetized.
# ──────────────────────────────────────────────────────────────────────────────

# ─── TAPS ─────────────────────────────────────────────────────────────────────
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "koekeishiya/formulae"
tap "vitorgalvao/tiny-scripts"

# ─── FORMULAE (CLI tools, libs, dev) ─────────────────────────────────────────
brew "antidote"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aribb24"
brew "ast-grep"
brew "autoconf"
brew "awscli"
brew "bash"
brew "bat"
brew "black"
brew "blueutil"
brew "brotli"
brew "btop"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cjson"
brew "cmake"
brew "colima"
brew "coreutils"
brew "curl"
brew "cyrus-sasl"
brew "dav1d"
brew "direnv"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "duck"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "flac"
brew "folderify"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gcc"
brew "gd"
brew "gettext"
brew "gh"
brew "giflib"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-filter-repo"
brew "github-keygen"
brew "glib"
brew "gmp"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "graphite2"
brew "harfbuzz"
brew "highway"
brew "icu4c@77"
brew "imagemagick"
brew "imath"
brew "isl"
brew "jasper"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jpegoptim"
brew "jq"
brew "krb5"
brew "lame"
brew "lazygit"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libde265"
brew "libdeflate"
brew "libevent"
brew "libgit2"
brew "libheif"
brew "libidn2"
brew "libimagequant"
brew "liblqr"
brew "libmicrohttpd"
brew "libmpc"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libogg"
brew "libomp"
brew "libpng"
brew "libpq"
brew "libraqm"
brew "libraw"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libudfread"
brew "libunibreak"
brew "libunistring"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libzip"
brew "lima"
brew "little-cms2"
brew "lpeg"
brew "luajit"
brew "luv"
brew "luarocks"
brew "lz4"
brew "lzo"
brew "m4"
brew "mackup"
brew "mas"
brew "mbedtls"
brew "mise"
brew "mkcert"
brew "mpdecimal"
brew "mpfr"
brew "mpg123"
brew "ncurses"
brew "neovim"
brew "net-snmp"
brew "nettle"
brew "node"
brew "nodenv"
brew "nvm"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "openssl@3"
brew "opus"
brew "oxipng"
brew "p0f"
brew "p11-kit"
brew "p7zip"
brew "pango"
brew "pcre2"
brew "php"
brew "pillow"
brew "pinentry-mac"
brew "pipx"
brew "pixman"
brew "pkgconf"
brew "pngpaste"
brew "pngquant"
brew "pure"
brew "pyenv"
brew "python@3.12"
brew "python@3.13"
brew "rav1e"
brew "readline"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "sdl2"
brew "shared-mime-info"
brew "simdjson"
brew "snappy"
brew "speex"
brew "sqlite"
brew "srt"
brew "starship"
brew "stow"
brew "svt-av1"
brew "tcl-tk@8"
brew "tesseract"
brew "theora"
brew "tidy-html5"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "typescript"
brew "unbound"
brew "unibilium"
brew "unar"
brew "unixodbc"
brew "usage"
brew "utf8proc"
brew "uvwasi"
brew "watch"
brew "webp"
brew "wget"
brew "wordnet"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zeromq"
brew "zimg"
brew "zoxide"
brew "zsh"
brew "zsh-async"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "zstd"

# ─── CASKS (grouped) ─────────────────────────────────────────────────────────

# Productivity & Launchers
cask "alfred"
cask "keyboard-maestro"
cask "launchbar"
cask "numi"
cask "typinator"

# System Utilities & Tuning
cask "bartender"
cask "cleanmymac"
cask "istat-menus"
cask "latest"
cask "macupdater"
cask "middle"
cask "mos"
cask "multitouch"
cask "onyx"
cask "superkey"
cask "tabtab"
cask "thelowtechguys-cling"

# Window / Display / Input Helpers
cask "betterdisplay"
cask "fixkey"
cask "keyclu"
cask "keycue"
cask "lunar"
cask "mac-mouse-fix"
cask "menubarx"
cask "rectangle-pro"
cask "swish"

# Files, Storage, Encryption
cask "appcleaner"
cask "cryptomator"
cask "disk-drill"
cask "drivedx"
cask "hazel"
cask "keka@beta"
cask "kekaexternalhelper"
cask "mountain-duck"
cask "path-finder"
cask "pearcleaner"

# Media (Play / Capture / Convert / Download)
cask "cleanshot"
cask "downie"
cask "folx"
cask "iina"
cask "imazing"
cask "kodi"
cask "mediamate"
cask "permute"
cask "shottr"
cask "stremio"

# Network / VPN
cask "nordvpn"
cask "surfshark"

# Dev / Packaging helpers
cask "ghostty"
cask "git-credential-manager"
cask "iterm2"
cask "itermai"
cask "itermbrowserplugin"
cask "jordanbaird-ice@beta"
cask "mist"

# Writing / AI / Utilities
cask "antinote"
cask "badgeify"
cask "blip"
cask "bloom"
cask "boltai"
cask "charmstone"
cask "chatgpt"
cask "chatgpt-atlas"
cask "clop"
cask "cork"
cask "customshortcuts"
cask "gemini"
cask "osaurus"
cask "popclip"
cask "rewritebar"
cask "superhuman"
cask "telegram-a"
cask "vanilla"
cask "voiceink"

# Dock & Menu Bar
cask "dockdoor"
cask "dockfix"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Apps with licensing or special installers
cask "1password"
cask "1password-cli"
cask "airbuddy"

# ─── MAS (Mac App Store) ─────────────────────────────────────────────────────
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 0
mas "Apple Configurator", id: 1037126344
mas "Baking Soda", id: 1601151613
mas "BarMarks", id: 6739710035
mas "Capture", id: 6458535284
mas "CotEditor", id: 1024640650
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 290986013
mas "DeskMinder", id: 6740942938
mas "Dory", id: 6746273626
mas "Dropover", id: 1355679052
mas "Dynaper", id: 1435296403
mas "Filebar", id: 1630856656
mas "Find Any File (FAF)", id: 0
mas "Folder Peek", id: 1615988943
mas "Folder Preview", id: 6698876601
mas "Folder Tidy", id: 486626129
mas "Friendly Streaming", id: 553245401
mas "Full Page Screenshot for Safari", id: 6745571462
mas "Gestimer", id: 6447125648
mas "GoodLinks", id: 1474335294
mas "Goodnotes", id: 1444383602
mas "Ground News", id: 1324203419
mas "Hand Mirror", id: 1502839586
mas "Hidden Bar", id: 1452453066
mas "Hush", id: 1544743900
mas "Image2Icon", id: 992115977
mas "Infuse", id: 1136220934
mas "JobSnail", id: 6449959070
mas "JuxtaText", id: 6504801865
mas "Keka", id: 470158793
mas "Klack", id: 6446206067
mas "Leftovers", id: 6746164364
mas "Maccy", id: 1527619437
mas "Mapper", id: 1589391989
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "Markdown Preview", id: 6739955340
mas "MousHero for Safari", id: 6447680045
mas "MyWallpaper", id: 1552826194
mas "NewsNinja", id: 6504148117
mas "Noir", id: 1592917505
mas "Notability", id: 360593530
mas "NotchDrop", id: 6529528324
mas "Numbers", id: 409203825
mas "Offloader", id: 6749336975
mas "One Markdown", id: 1507139439
mas "one sec", id: 1532875441
mas "Outpost", id: 6749519388
mas "Owlfiles", id: 510282524
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Parachute", id: 6748614170
mas "Parcel", id: 0
mas "Parcel - Delivery Tracking", id: 0
mas "Paste", id: 967805235
mas "Peek", id: 1554235898
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Plain Text Editor", id: 1572202501
mas "Prime Video", id: 545519333
mas "rcmd", id: 1596283165
mas "ReddBar", id: 6739960301
mas "Redirect Web", id: 1571283503
mas "Refined GitHub", id: 1519867270
mas "Scratchpad", id: 6504040051
mas "Shadowrocket", id: 932747118
mas "Shareful", id: 1522267256
mas "Short Run", id: 6745427035
mas "SingleFile", id: 6444322545
mas "Sink It", id: 6449873635
mas "SnippetsLab", id: 1006087419
mas "Snippety", id: 1530751461
mas "Speedtest", id: 1153157709
mas "StopTheMadness Pro", id: 6471380298
mas "Structured", id: 1499198946
mas "Super Agent", id: 1568262835
mas "TabBack", id: 1660506599
mas "Tampermonkey", id: 6738342400
mas "TestFlight", id: 899247664
mas "Text Workflow", id: 1600520682
mas "Textastic", id: 572491815
mas "TextSniper", id: 1528890965
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Total Refresh", id: 1573919086
mas "ToyViewer", id: 414298354
mas "Transloader", id: 572281534
mas "TV Remote", id: 1535056536
mas "UltraNotes", id: 6468902627
mas "URLtoQR", id: 1586089723
mas "Userscripts", id: 1463298887
mas "VidHub", id: 1659622164
mas "Vidimote", id: 1585702412
mas "Vinegar", id: 1591303229
mas "xReload", id: 1588834516
mas "xSearch", id: 1579902068
mas "YABA", id: 6747272081
mas "Yoink", id: 457622435